import React from 'react';
import AppSelectPicker from '@components/AppPicker/AppSelectPicker';
import AppDivider from '@components/AppDivider';

interface TermsPrivacyProps {
  onTermsDateChange: (type: string, date: string) => void;
  selectedTermsDate: string;
}

const TermsPrivacy: React.FC<TermsPrivacyProps> = ({ onTermsDateChange, selectedTermsDate }) => {
  return (
    <div className={'terms__wrapper'}>
      <div className={'selected-terms'}>
        <h2 className={'selected-terms__title'}>원스토어 광고센터 이용약관</h2>
        <div>
          <AppSelectPicker
            data={[{ label: '[현행] 2022. 11. 24', value: '20221124' }]}
            searchable={false}
            cleanable={false}
            value={selectedTermsDate}
            style={{ width: 160 }}
            onChange={(value) => onTermsDateChange('service', value)}
          />
        </div>
      </div>
      <AppDivider style={{ marginTop: 20, marginBottom: 30 }} />
      <div className={'section__wrapper'}>
        <div className={'section'} style={{ marginTop: 0 }}>
          <div className={'section__desc'} style={{ paddingTop: 0 }}>
            <p>
              사이트로서의 원스토어 광고센터(
              <a href={'https://onestoreads.co.kr'} target={'_blank'}>
                https://onestoreads.co.kr
              </a>
              )와, 그 사이트에 가입하는 고객사(이하 ‘회원’) 사이의 의무와 권리에 관한 약관입니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제1조 (목적)</h4>
          <div className={'section__desc'}>
            <p>
              본 약관은 원스토어 주식회사(이하 “회사”라 함)가 “회원”의 광고 및 프로모션을 진행함에 있어 필요한 제반 사항
              및 서비스(이하 "서비스"라 함)를 이용하는 자의 권리, 의무를 확정하고 이를 이행함으로써 상호 발전을 도모하는
              것을 그 목적으로 합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제2조 (효력과 변경)</h4>
          <div className={'section__desc'}>
            <p>
              1. 본 약관은 회원에게 웹사이트, 기타 서비스 관련 웹페이지 등을 통해 공지하거나 기타의 방법으로 회원에게
              공지함으로써 효력을 발생합니다.
            </p>
            <p>
              2. 회사는 영업상 필요 또는 기타 사정 변경이 있을 때 약관을 변경할 수 있으며, 그 내용을 본 조 제1항과 같은
              방법으로 그 적용일자 7일 전부터 공지합니다. 다만, 회원에게 불리한 약관의 변경인 경우에는 그 적용일자 30일
              전부터 공지하며, 관련 내용을 E-mail로 회원에게 개별 통지합니다. (다만, 회원의 연락처 미기재, 변경 등으로
              개별통지가 어려울 때에는 홈페이지에 변경 약관을 공지함으로써 개별적으로 통지한 것으로 간주합니다.)
            </p>
            <p>
              3. 회사가 본 조 제2항에 따라 변경 약관을 공지 또는 통지하면서, 회원이 약관 변경 적용일 까지 거부의사를
              표시하지 아니하는 경우 약관의 변경에 동의한 것으로 간주한다는 내용을 공지 또는 통지하였음에도 회원이
              명시적으로 변경된 약관의 효력 발생일까지 약관 변경에 대한 거부의 의사표시를 하지 않는 경우 회원은 변경된
              약관에 동의한 것으로 간주됩니다. 회원은 변경된 약관에 동의하지 않을 경우 본 서비스 이용을 중단하고
              이용계약을 해지할 수 있습니다.
            </p>
            <p>4. 새로운 서비스가 개설될 경우 별도의 명시된 설명이 없는 한, 본 약관에 따라 제공합니다.</p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제3조 (용어의 정의)</h4>
          <div className={'section__desc'}>
            <p>1. 본 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
            <ul>
              <li>1. 회원 : “회사”와 본 서비스 이용계약을 체결한 자</li>
              <li>2. 이용자 : “회사”가 제공하는 “광고서비스”를 이용하는 자</li>
              <li>
                3. 광고서비스 : “회원”이 직접 또는 제 3자가 운영하는 게임, 모바일 어플리케이션 등(이하 “광고대상 등”이라
                합니다.)을 이용자에게 홍보하기 위하여 “광고플랫폼”에서 이용자에게 “광고소재”을 보여주는 등의 방식으로
                진행하는 온라인 광고 서비스
              </li>
              <li>4. 아이디(ID) : “광고계정”의 책임자 권한을 가지고 해당 “광고계정”을 관리 및 운영하는 “회원”</li>
              <li>
                5. 광고계정 : “회원”이 “광고플랫폼”에서 특정 브랜드 또는 상품 등을 “광고”하고 이를 관리 및 운영할 수
                있도록 “회원”이 설정한 단위
              </li>
              <li>
                6. 광고센터 : “회원”이 광고의 신청, 게재, 관리, 취소 등을 할 수 있으며, 광고의 목적과 그룹(타게팅,
                광고매체, 과금방식 등) 그리고 소재유형을 선택 후 진행할 수 있도록 “회사”가 제공하는 플랫폼
              </li>
              <li>
                7. 광고매체 : “회사”가 설계, 제작 및 운영하는 디지털 광고 전문 솔루션 및 “회사”가 판매 대행하는
                매체사에서 제공하는 매체
              </li>
              <li>
                8. 광고소재 : “회원”이 “광고센터”에 등록하여 “광고매체”에 게재되는 제목, 설명문구/텍스트, 부가정보,
                이미지, 키워드, 동영상, 연결화면(랜딩페이지) 등의 광고 내용
              </li>
              <li>9. 광고대상 : “원스토어 개발자센터에 등록하여 원스토어 앱에서 판매 중인 모바일 어플리케이션</li>
              <li>10. 애드서버 : “광고센터”가 운영되는 네트워크, 서버 및 클라우드 솔루션, 인프라</li>
              <li>11. 광고집행 : “회원”이 “광고서비스”에서 진행하는 개별 집행 단위로서 캠페인, 그룹, 소재 등</li>
              <li>
                12. 광고게재신청 : “회원”이 개별 “광고집행”을 위해 “회사”가 정한 절차에 따라 광고 등록을 신청하고
                “회사”는 본 운영정책 등에 따라 승낙하여 성립하는 법률행위
              </li>
              <li>13. 광고집행금액 : “회원”이 “광고게재신청” 시점에 설정한 총 광고비용</li>
              <li>
                14. 실정산금액 : “광고집행금액”에서 ”회사”와 “회원”이 별도 합의한 기타조정금액, 쿠폰 금액 등을 공제한
                금액으로 “회원”이 “회사”에게 실제 지급하여야 하는 금액
              </li>
              <li>15. 탈퇴 : 회사 또는 회원이 본 서비스 가입 후 이용 계약을 해약하는 것</li>
            </ul>
            <p>
              2. 본 약관에서 사용하는 용어의 정의는 본 조 제1항에서 정하는 것을 제외하고는 관계 법령 및 서비스 별
              안내에서 정하는 바에 의합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제4조 (광고서비스의 제공)</h4>
          <div className={'section__desc'}>
            <p>
              1. ”회사”는 “광고센터”를 통하여 광고의 게재 및 집행 등 “광고서비스”를 이용하기 위하여 필요한 각종 제반
              기능을 제공합니다.
            </p>
            <p>
              2. “회사"는 광고의 종류 및 내용, 광고 게재 절차/영역 등 "광고서비스"와 관련된 상세 내용을 "광고센터"를
              통하여 안내할 수 있으며 "회원"은 “광고서비스” 이용 전에 이를 신중히 확인하여야 합니다.
            </p>
            <p>
              3. “광고서비스”는 “회원”이 “광고게재신청”한 내용을 기준으로 하되 Real Time Bidding 등 “광고서비스”의
              정책에 따라 “광고집행” 여부가 결정되므로 특정한 게재 시점이나 노출수, 클릭수 등을 보장하지 않습니다.
              이러한 경우 “광고대금”은 실제 발생한 노출, 클릭 등을 기준으로 과금됩니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제5조 (광고계정의 생성 및 관리)</h4>
          <div className={'section__desc'}>
            <p>
              1. “회원”이 “광고계정” 생성 시 “회원”은 광고하고자 하는 대상 및 내용에 대한 적법한 권리를 스스로
              보유하거나 그러한 권리를 가진 제3자로부터 권한을 위임 받고 허락을 득하여야 하며, 이를 위반하여 발생한
              문제에 대한 책임은 “회원”에게 있습니다.
            </p>
            <p>
              2. “회원”은 “광고계정”에 등록된 사업자정보 등에 변동사항이 있을 경우 “회사”가 정한 절차에 따라 “광고센터”
              또는 “고객센터”를 통하여 변경사항을 알려야 하며, 이를 준수하지 않아 발생한 불이익에 대하여 “회사”는 책임을
              지지 않습니다.
            </p>
            <p>3. “광고계정”이 아래의 각 호에 해당되는 경우 “회원”의 “광고센터” 이용이 제한될 수 있습니다.</p>

            <ul>
              <li>1. “광고소재”과 관련 없는 사업자를 광고주로 선택하거나 허위로 “광고계정”을 생성한 경우</li>
              <li>2. “광고집행” 이외의 다른 목적이나 부정한 목적을 위하여 “광고계정”을 생성하거나 사용하는 경우</li>
              <li>
                3. 광고의 게재 및 운영에 대한 적법한 권한 없이 타인의 사업/상품/사이트를 광고하기 위해 “광고계정”을
                생성하여 운영하는 경우
              </li>
              <li>4. 관련 법령이나 매체의 정책 변경으로 광고 게재가 중단되어야 하는 경우</li>
              <li>5. 본 약관 제5조 광고집행 제5항에 해당하는 광고소재가 포함되어 있는 경우</li>
              <li>6. 기타 관련 법령 및 본 약관 또는 “회사”의 가이드에 위반되는 경우</li>
            </ul>
            <p>
              4. “회사”는 관련 법령 및 본 약관 등을 위반한 관계로 “광고계정”을 삭제한 “회원”이 다시 “광고계정”을
              생성하는 것을 제한할 수 있습니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제6조 (광고물 등록 및 심사)</h4>
          <div className={'section__desc'}>
            <p>
              1. “회원”은 “광고센터”를 통해 관련 법령, 본 약관, 심사가이드에 부합하는 “광고소재”을 등록하여야 하며, 심사
              승인된 “광고소재”에 한하여 집행이 가능합니다.
            </p>
            <p>
              2. “회사”는 광고 심사 결과를 “광고센터”를 통해 안내합니다. “광고소재” 심사는 “회사”의 정해진 업무 시간에만
              진행됩니다.
            </p>
            <p>
              3. 심사 승인 이후 “광고소재”의 내용 및 연결화면, 사이트 등이 법령, 본 약관, 심사가이드 등을 위반한 것이
              확인될 경우 “회사”는 “회원”에게 “광고소재”의 수정을 요청하거나, “광고집행” 중단, “광고서비스” 이용 제한
              등을 할 수 있습니다.
            </p>
            <p>
              4. 제3항에 따른 수정 요청을 받은 “회원”은 “회사”가 안내한 기한까지 “광고소재”이 법령, 본 약관, 심사가이드
              등을 위반하지 않도록 수정해야 하며, 기한 내 수정되지 않은 “광고소재”은 지체없이 광고 게재가 중단될 수 있고
              이로 인해 발생하는 불이익은 “회원”이 부담해야 합니다.
            </p>
            <p>5. 심사 보류된 “광고소재”은 보류 사유 수정 후 재심사 요청을 할 수 있습니다.</p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제7조 (광고집행 계약의 체결)</h4>
          <div className={'section__desc'}>
            <p>
              1.“광고집행” 계약은 “회사”가 정한 절차에 따라 “회원”이 “광고센터”에서 “광고게재신청”을 하고 “회사”가 이를
              승낙함으로써 체결됩니다.
            </p>
            <p>
              2.“회원”은 반드시 “회사”가 요구하는 양식과 절차를 통해 “광고집행”을 신청해야 합니다. “회사”는 “회원”의
              신청에 대해 심사기준, 승낙 여부나 방식 등을 결정할 권한을 가지며, 관련법령 및 “회사”의 기준에 따라
              “회원”에게 신청한 내용의 변경을 요청할 수 있습니다.
            </p>
            <p>
              3. "회원"은 자신이 신청한 “광고소재” 또는 “회원” 자신이 관련 법령을 위반하거나 제 3자의 권리를 침해하지
              않도록 하여야 합니다.
            </p>
            <p>
              4. "회사"가 본 조에 따라 광고의 집행을 승낙한 것이 해당 광고의 “광고소재” 또는 “회원” 자신이 위법하지
              않거나 본 약관, 이용안내 등에 적합함을 최종적으로 보증하거나 보장하는 것은 아니며 승낙 이후에도 “광고소재”
              자체 또는 “광고소재”의 서비스 등이 관련 법령 또는 본 약관, 이용안내 등에 위반하는 것이 확인될 경우
              "회사"는 본 약관에 따라 광고의 집행계약을 해지할 수 있습니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제8조 (광고집행)</h4>
          <div className={'section__desc'}>
            <p>1. “회사”의 “광고센터”를 통해서 진행하는 모든 “광고집행”은 “회사”의 ‘애드서버’를 기본으로 합니다.</p>
            <p>
              2. “회사”가 “회원”의 광고를 수행하는 과정에서 집계하는 집행 수량은 모바일 디바이스의 ADID, IDFA 등
              표준적으로 사용되는 광고식별값을 기준으로 하며, ADID, IDFA가 아닌 다른 기준의 집계수치와는 차이가 발생할
              수 있습니다.
            </p>
            <p>
              3. “회사”는 광고가 집행되는 “광고매체”의 범위 및 “광고매체”에서의 광고 집행영역, 순서, 정보, UI, 방식등에
              대한 결정 권한을 가지며, 변경 또는 추가할 수 있습니다.
            </p>
            <p>
              4. “광고매체”의 운영자가 정당하고 합리적인 이유를 근거로 자신의 “광고매체”에서 특정 광고의 게재 제한이나
              게재 영역 등의 변경을 요청하는 경우 “회사”는 해당 광고의 게재를 제한하거나 게재 영역 등을 변경할 수
              있습니다.
            </p>
            <p>
              5. “광고매체”의 범위에 변경이 있는 경우 “회사”는 그 변경 전에 “광고센터” 내 게시판에 공지합니다. 단,
              제3자가 운영하는 “광고매체”는 별도의 공지 없이 범위가 변경될 수 있으며, “회원”은 변경 내용에 동의하지 않을
              경우 언제든지 자신의 “광고계정”에서 변경된 내용으로 진행되는 광고의 노출을 중단할 수 있습니다.
            </p>
            <p>
              6. “회사”는 수시로 광고의 품질 향상 및 효과 증대 등을 위해 테스트를 별도의 공지 없이 진행할 수 있습니다.
            </p>
            <p>7. “회사”는 광고가 아래의 항목에 해당하는 경우 광고의 전부 또는 일부의 집행을 제한할 수 있습니다.</p>
            <ul>
              <li>
                1. 관련 법령 및 본 약관, 심사가이드, 기타 “회사”가 다양한 방법으로 안내한 사항 등을 포함하여 “회사”의
                정책을 위반하는 경우
              </li>
              <li>
                2. 관련 법령을 위반하지 않더라도 도의적으로 비난의 대상이 되거나 보편적 사회정서를 침해하는 등의 사회적
                혼란을 야기할 우려가 있는 경우
              </li>
              <li>3. 청소년보호법에 따라 청소년에게 유해하다고 판단되는 경우</li>
              <li>4. 지식재산권을 포함하여 제3자의 권리를 침해하는 경우</li>
              <li>5. “광고매체” 또는 “이용자”가 광고에 대하여 이의를 제기한 경우</li>
              <li>6. “회사” 및 “광고센터”의 명예ㆍ평판ㆍ신용이나 신뢰도를 훼손하거나 훼손할 우려가 있는 경우</li>
              <li>7. “광고서비스” 또는 “광고센터”의 품질을 저하시키거나 저하시킬 우려가 있는 경우</li>
              <li>
                8. “광고소재”이 “광고”의 내용과 다르거나 “이용자”에게 불쾌감, 두려움, 혐오감 등을 조성하거나 그러한
                우려가 있는 경우
              </li>
            </ul>
            <p>
              8. “회사”는 ”광고서비스”의 대상이 된 “광고대상”의 소유자나 서비스를 제공하는 자에게 해당 광고의 게재
              내역에 관한 정보를 제공할 수 있습니다.
            </p>
            <p>9. “회원”은 “광고센터”에서 언제든지 광고 집행의 중단을 신청할 수 있습니다.</p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제9조 (광고의 타겟 설정)</h4>
          <div className={'section__desc'}>
            <p>
              1. “회사”는 “광고”의 특성에 따라 “회원”이 “광고집행”을 위해 직접 또는 제3자를 통해 수집 또는 보유한 활동
              로그를 사용하여 “광고”의 타겟을 설정할 수 있는 기능(“회사”가 제공하는 “API”를 이용하는 기능을 포함하며,
              이하 “타겟 설정”이라 합니다)을 제공할 수 있습니다.
            </p>
            <p>
              2. “회원”은 “타겟 설정”을 이용하는 경우 필요한 범위 내에서 “회사”에게 활동 로그의 처리를 위탁하며, 활동
              로그에 대한 모든 권리와 책임을 부담합니다.
            </p>
            <p>
              3. “회원”은 “타겟 설정”을 위한 활동 로그의 수집을 위해 정보 주체에게 수집 사실을 알리고 적법하게 개별적
              동의를 받았으며, 대한민국 및 “회원”이 소속된 국가의 모든 개인정보 관련법령과 정부기관의 규정 및
              가이드라인을 준수하였음을 진술 및 보증합니다.
            </p>
            <p>
              4. “회원”은 “회사”에게 전달한 모든 활동 로그의 사용을 위해 필요한 모든 권리와 권한을 적법하게 보유하고
              있음을 보증합니다.
            </p>
            <p>
              5. “회원”은 “타겟 설정”에 사용되는 활동 로그의 주체가 정보 이용 동의 철회 또는 정보의 수집 및 이용을
              거부하는 경우, 즉시 “타겟 설정”을 위해 등록한 해당 정보주체의 정보를 삭제하여야 합니다. 또한 “회원”이 본
              항의 의무를 즉시 이행하지 아니할 경우 “회사”가 대신하여 삭제하는데 동의합니다.
            </p>
            <p>
              6. “회원”이 2개 이상의 “광고대상”을 위해 “광고집행” 및 “타겟 설정”을 하는 경우 서로 다른 “광고대상”의 활동
              로그를 임의로 결합하거나 보완할 수 없습니다.
            </p>
            <p>
              7. “회원”은 “타겟 설정”을 통해 도출된 타겟 이용자 리스트와 관련 정보 일체를 제3자에 판매하거나 양도할 수
              없으며, 제3자가 판매하거나 양도하도록 허용할 수 없습니다.
            </p>
            <p>
              8. “회사”는 “타겟 설정”을 위해 “회원”이 제공 및 위탁한 활동 로그를 “타겟 설정” 목적 이외에 사용하지
              않으며, “회원”이 사전 허락한 경우 또는 법적으로 요구되는 경우를 제외하고 제3자에게 해당 활동 로그 또는
              “타겟 설정”에 대한 엑세스를 제공하지 않습니다.
            </p>
            <p>
              9. “회사”는 “타겟 설정”을 위해 “회원”이 제공 및 위탁한 활동 로그의 보안을 유지하기 위하여 필요한 합리적,
              기술적, 관리적 보호조치를 수행합니다.
            </p>
            <p>
              10. 본 조에서 정한 사항 이 외 ”API” 기능 및 조건 기타 “API” 관련 사항은 “회사”가 공지하거나 통지한 사항
              등에 따릅니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제10조 (“회사”의 의무)</h4>
          <div className={'section__desc'}>
            <p>1. “회사”는 제6조에 해당하는 업무를 “회사”의 책임 하에 수행합니다.</p>
            <p>
              2. “회사”는 “회원”에게 “회원”의 광고분석(트래픽 분석 자료 등) 및 광고 수행의 결과를 확인할 수 있는
              리포트(이하 “리포트”)를 제공하여야 합니다.
            </p>
            <p>
              3. “회사”는 “회원”에게 제공하는 “리포트”가 관련 법령을 위반하지 않으며, 진정하고 정확한 자료임을 보증해야
              합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제11조 (“회원”의 의무)</h4>
          <div className={'section__desc'}>
            <p>
              1. “회원”은 광고를 의뢰하고 세부적인 광고를 진행할 수 있는 모든 법적인 권한을 보유하고 있는 것을 보증하며,
              회사의 요청 시 이를 입증할 자료를 제출할 의무가 있습니다.
            </p>
            <p>2. “회원”은 광고를 위한 ”광고소재”를 “광고게재신청” 시 “광고센터”에 등록합니다.</p>
            <p>
              3. “회원”은 “회사”의 ”애드서버”를 통해 분석한 ”리포트”를 사용함에 있어 “회사”의 업무에 해를 끼치지 않아야
              합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제12조 (“광고집행금액” 및 “실정산금액”)</h4>
          <div className={'section__desc'}>
            <p>
              1. “광고집행금액”은 본 약관 “광고게재신청”을 통해 “회원”이 신청한 금액을 기준으로 하되 실제 “광고집행”
              기준으로 산정되므로 “광고게재신청” 내용과 달라질 수 있습니다.
            </p>
            <p>
              2. “회원”은 “광고서비스”의 대가로 “광고집행금액”에서 “회사”와 “회원”이 합의한 기타조정금액, 쿠폰 금액을
              제외한 “실정산금액”을 “회사”에게 지급합니다. “회원”은 “광고센터” 내 개별 정산내역을 통해 전월
              “실정산금액”을 사전에 확인할 수 있습니다.
            </p>
            <p>
              3. “회사”는 “광고대금”의 청구 또는 영수를 위한 서류(세금계산서, Invoice 등)를 “광고계정” 단위(개인 또는
              사업자)로 발행합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제13조 (“실정산금액”의 정산)</h4>
          <div className={'section__desc'}>
            <p>
              1. 양 당사자는 본 약관“실정산금액”의 지급방식을 후불로 합의하며, “회사”는 “광고집행”이 이루어진 해당
              월(이하 “정산월”)의 말일자를 작성연월일로 하는 세금계산서를 발행하여 “회원”에 “광고대금”을 청구하고,
              “회원”는 세금계산서 발행일로부터 익월 말일까지 “회사”에게 “실정산금액”을 현금으로 지급합니다.
            </p>
            <p>
              2. 본 조본 약관에 따른 “실정산금액”의 지급이 지연되는 경우, “회사”는 그 지연되는 기간에 대하여 하도급법
              제13조 제8항에 의하여 공정거래위원회가 정하여 고시하는 지연이자를 “회원”에 청구할 수 있으며, 미지급금 발생
              이후에 진행되는 광고의 집행분에 대해서는 “실정산금액” 지급이 완료될 때까지 해당 광고의 집행을 보류할 수
              있습니다. 전술한 규정에 따라 광고 집행이 보류 또는 중단되어 위약금, 수수료 기타 비용 등이 발생하는 경우
              “회원”가 이를 부담합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제14조 (지식재산권)</h4>
          <div className={'section__desc'}>
            <p>
              1. 본 약관약관에 정한 업무 수행을 위하여 상대방에게 제공되는 광고물, 솔루션 등의 소유권, 저작권 등의
              권리는 제공한 각 당사자에게 귀속된다.
            </p>
            <p>2. 각 당사자는 상대방에게 제공하는 자료 등이 타인의 지식재산권을 침해하지 않음을 보증합니다.</p>
            <p>
              3. 상대방에게 제공한 자료 등으로 인하여 제기되는 상표권, 저작권, 디자인권 등 지식재산권 침해 분쟁 및 그 외
              법적 분쟁에 대하여, 일방 당사자는 이를 자신의 책임과 비용으로 방어하고 해결하며 상대방을 면책해야 하고,
              그로 인하여 상대방이 입은 모든 손해를 배상하여야 합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제15조 (비밀유지)</h4>
          <div className={'section__desc'}>
            <p>
              1. 본 약관 각 당사자의 임직원은 본 약관과 관련하여 상대방으로부터 취득하거나 알게 된 기술정보, 제품정보,
              경영정보, 업무상 비밀, 영업비밀 등 상대방의 정보 또는 본 약관에 따라 발생한 모든 결과물 및 본 약관의
              내용(이하 ‘비밀정보’라 함)을 엄격히 비밀로 유지 및 관리하여야 하며, 상대방의 사전 서면 동의 없이는 이를
              제3자에게 제공하거나 공개하여서는 아니되며, 본 약관에 정한 목적 또는 본 약관에 따른 업무의 수행을 위한
              목적 이외의 목적으로 사용할 수 없습니다.
            </p>
            <p>
              2. 각 당사자는 본 약관에 따른 업무 수행을 위하여 ‘비밀정보’에 접근할 필요가 있는 인원으로서 본 조항에
              준하는 비밀유지서약서를 제출한 인원을 제외한 어떠한 제3자에게도 ‘비밀정보’를 공개해서는 아니 된다.
            </p>
            <p>
              3. 각 당사자는 본 약관에 따른 업무 수행이 종료되거나 해제 또는 해지 등의 사유로 본 약관이 종료된 경우 또는
              계약기간 중이라도 상대방의 요구가 있는 경우에는 ‘비밀정보’의 사용을 즉시 중단하여야 하고, 제공된
              ‘비밀정보’의 원본, 복사본, 기타 상대방으로부터 제공받은 모든 서류와 자료 및 이를 기초로 하여 상대방이 가공
              또는 획득한 제반 정보들을 모두 반환 또는 폐기하여야 합니다.
            </p>
            <p>
              4. 이 조항에 명시된 비밀유지의무는 본 약관의 존속 및 효력 유지와 관계없이 본 약관이 종료된 때로부터 3년간
              유효합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제16조 (이용제한)</h4>
          <div className={'section__desc'}>
            <p>
              1. ”회사”는 ”회원”이 관련 법령 및 본 약관, 심사가이드 등에 따른 의무를 위반하는 경우 “광고소재” 제한,
              사이트 제한, “광고서비스” 이용제한 및 집행계약 해지 등의 조치(이하 “이용제한 조치”라 합니다)를 할 수
              있으며, 그 구체적인 기준 등에 대해서는 회사가 정하는 바에 따릅니다. “이용제한 조치”는 위반 활동의 누적
              정도에 따라 한시적 제한에서 영구적 제한으로 단계적 제한하는 것을 원칙으로 하지만, 관련 법령에서 금지하는
              명백한 불법행위나 긴급한 위험 또는 피해 차단이 요구되는 사안에 대해서는 위반 활동 횟수의 누적 정도와 관계
              없이 즉시 영구적으로 이용이 제한될 수 있습니다.
            </p>
            <p>
              2. ”회원”이 다음 각 호에 해당하는 경우 "회사"는 "회원"에게 본조 제1항에 따른 “이용제한 조치”를 할 수
              있습니다.
            </p>
            <ul>
              <li>1. "회원"이 “실정산금액”의 지급을 고의적으로 회피하는 것으로 볼 수 있는 행위를 하는 경우</li>
              <li>2. "회원"이 타인의 명의를 도용하는 경우</li>
              <li>3. "회원"이 회원정보를 허위로 기재하거나, 휴업 또는 폐업자로 확인되는 경우</li>
              <li>4. "회원"이 관련 법령 위반을 하는 경우</li>
              <li>5. "회원"이 "회사"의 경고에도 본 약관 또는 정책을 고의적 및 반복적으로 위반하는 경우</li>
              <li>6. 금융기관으로부터 거래정지 처분을 받고 계약을 수행할 능력이 없다고 인정되는 경우</li>
              <li>7. 감독기관으로부터 영업취소 또는 정지 등의 처분을 받은 경우</li>
              <li>
                8. 어음 및 수표의 부도, 제3자에 의한 강제집행(가압류 및 가처분 포함), 파산선고 또는 회사정리의 신청 등
                경영상 중대한 사유가 발생하여 계약을 수행할 능력이 없다고 인정되는 경우
              </li>
              <li>9. 상대방의 동의 없이 계약상의 권리 및 의무를 제3자에게 양도한 경우</li>
            </ul>
            <p>
              3. 본 약관 상 ”회사”는 ”회원”에게 다음 각호의 사유가 발생한 경우, 서면으로 15일 기간을 정하여 상대방에게
              그 이행을 최고하고 그 기간 내에 이행되지 아니한 본 약관 ”이용제한 조치”를 할 수 있습니다.{' '}
            </p>
            <ul>
              <li>
                1. 본 약관 상 정당한 사유 없이 본 약관 상의 용역수행에 필요한 제반사항의 이행을 지연하여 상대방의 업무에
                지장을 초래하거나 본 약관의 목적 달성이 어렵다고 인정되는 경우
              </li>
              <li>2. 본 약관에 따른 “실정산금액” 지불을 지연하거나 지불하지 않은 경우</li>
              <li>
                3. “회사”가 “광고서비스”의 제공을 할 수 없게 되는 경우 등 기타 계약을 유지할 수 없는 중대한 사유가 있는
                경우
              </li>
            </ul>
            <p>
              4. 당사자는 제2항 및 제3항 각 호의 사유가 발생한 경우 상대방에게 지체 없이 서면(전자우편 포함)으로
              통지하여야 합니다.
            </p>
            <p>
              5. “회원”은 “이용제한 조치” 시점까지 발생한 “실정산금액”을 “회사”에게 지급할 의무가 있고, “회원”은
              “이용제한 조치” 시점 또는 업무 중단 시점 중 앞선 시점으로부터 30일 이내에 지급하도록 하고, “실정산금액”의
              지급이 지연되는 경우 제11조 제2항의 규정을 준용하기로 합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제17조 (손해배상)</h4>
          <div className={'section__desc'}>
            <p>
              1. 양 당사자는 본 약관 상의 각각의 책임과 의무를 다하지 못하거나 본 약관 상의 의무를 위반하여 상대방 또는
              제3자에게 손해를 끼쳤을 경우 그 손해에 대한 배상의 책임을 집니다.
            </p>
            <p>
              2. “회사”의 귀책사유가 없음에도 “회원”가 본 약관 일부 또는 전부를 위반하여 “회사”가 제3자에게 부담해야
              하는 위약금, 수수료 등 기타 비용이 발생하는 경우 “회원”는 본조 제1항의 손해배상과 별개로 해당 비용을
              부담하기로 합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제18조 (양도금지)</h4>
          <div className={'section__desc'}>
            <p>
              양 당사자는 상대방의 서면 동의 없이 본 약관상의 지위 또는 권리의무의 전부 또는 일부를 제3자에게 양도,
              하도급, 담보제공 등 일체의 처분행위를 할 수 없습니다. 단, 사전서면 통지를 수반한 합병 분할 등 포괄적 지위
              승계는 본 조항의 양도로 보지 아니합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제19조 (책임제한)</h4>
          <div className={'section__desc'}>
            <p>
              1. 서버 장애, 기간통신사업자의 회선 장애, 각 당사자는 천재지변, 전쟁, 내란, 폭동, 화재, 테러, 홍수, 지진,
              폭풍, 정부의 규제, 관련 법령의 개폐, 해킹, 전염병의 창궐, ”광고매체”의 장애 또는 이에 준하는 ”회사”의 귀책
              없는 사유로 인하여 ”광고서비스”를 제공할 수 없는 경우에는 이에 관한 책임을 지지 않습니다.
            </p>
            <p>
              2. ”회사”는 “광고매체” 및 ”광고매체”에서 노출되는 검색결과 또는 콘텐츠의 신뢰도, 정확성, 적법성 등에
              관하여 보증하지 않습니다. 다만, ”광고매체”가 관련 법령 또는 ”회사”의 광고매체정책을 위반하는 경우 ”회사”는
              해당 ”광고매체”에 광고를 게재하지 않을 수 있으며, 해당 ”광고매체”에 광고 게재 또는 게재 중단과 관련하여
              ”회사”는 책임을 지지 않습니다.
            </p>
            <p>
              3. ”회사”는 “광고매체”에서 노출되는 검색결과 또는 콘텐츠가 ”회원”에게 우호적인 내용으로 구성되어 있음을
              보증하지 않으며, ”회원”에게 부정적인 내용으로 구성된 검색결과 또는 콘텐츠와 함께 광고가 게재된 것에 대하여
              ”회사”는 책임을 지지 않습니다.
            </p>
            <p>
              4. ”회사”는 광고 효과 향상을 위해 “회원”에게 “광고”의 이용조건 설정기능을 제공할 수 있으며, ”회원”이
              설정한 조건에 따라 ”광고”이 진행될 수 있도록 최선을 다 합니다. 단, “회사”는 “회원”이 설정한 조건에 따라
              “광고”이 진행됨을 보증하지 아니하며, 설정된 조건과 다르게 진행되는 “광고”에 대하여 ”회사”는 책임을 지지
              않습니다.
            </p>
            <p>
              5. ”회사”는 광고운영의 편의를 위해 “회원”에게 광고 조건(기간, 이용료 등)을 설정하면 시스템에 따라 자동으로
              광고 게재 및 광고 관리를 할 수 있는 기능을 제공 할 수 있습니다. ”회원”이 해당 기능을 이용하여 자동 광고
              운영을 신청하는 경우 “회사”는 이에 따라 광고를 게재하며, “회사”는 자동 광고 운영 결과에 대하여 책임을 지지
              않습니다.
            </p>
            <p>
              6. "회사”는 “회원”의 귀책사유로 인하여 발생한 “광고서비스” 이용 장애(광고 미게재 등을 포함합니다.)에
              대하여 책임을 지지 않습니다.
            </p>
            <p>
              7. “회원”의 “광고”가 지식재산권을 포함한 제3자의 권리를 침해하거나 허위정보 등을 포함함으로써 관련 법령
              위반 또는 제3자(“이용자”를 포함합니다.)에 대한 손해를 발생시킨 경우 “회사”는 이에 대하여 책임을 지지
              않습니다.
            </p>
            <p>
              8. 제3자를 위하여 “광고서비스”를 이용하는 “회원”의 귀책사유로 제3자에게 손해가 발생하는 등 “회원”과
              제3자간 분쟁이 발생하는 경우 및 “회원” 간 분쟁이 발생하는 경우 “회사”는 이와 관련된 책임을 지지 않습니다.
            </p>
            <p>
              9. “회사”는 “회원”이 “광고센터”에 등록한 “광고소재” 및 “광고소재”에 연결된 페이지에서 특정 브라우저나 앱
              등 일부 환경에서만 제한적으로 발생하는 오류 또는 장애에 대하여는 책임을 지지 않으며, 이에 대한 사전 확인
              의무는 “회원”에게 있습니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>제20조 (기타)</h4>
          <div className={'section__desc'}>
            <p>
              1. 본 약관의 해석에 대하여 이견이 있거나 본 약관에서 규정하지 아니한 사항에 대해서는 관련 법령 및 상관례에
              따라 “회원”와 “회사”가 상호 협의하여 결정합니다.
            </p>
            <p>
              2. 본 약관 이행에 있어 분쟁이 발생할 경우에는 양 당사자는 최우선적으로 협의를 통해 해결하도록 노력하기로
              하며, 만약 협의를 통한 해결이 어려운 경우 서울중앙지방법원을 전속적 합의 관할 법원으로 하여 일체의 분쟁을
              해결합니다.
            </p>
            <p>
              3. 본 약관의 이행과 관련하여 각 당사자의 실무 담당자의 행위는 해당 당사자로부터 적법한 권한을 부여 받은
              대표자 또는 대리인의 행위로 간주합니다.
            </p>
          </div>
        </div>
        <div className={'section'}>
          <h4 className={'section__title'}>부칙</h4>
          <div className={'section__desc'}>
            <p>본 운영정책은 2022년 11월 24일부터 시행됩니다.</p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default TermsPrivacy;
